app/controllers/epicenter_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def feed
    @following_tweets = []

    Tweet.all.each do |tweet|

SELECT "users".* FROM "users"
---
  def all_users
    @users = User.all #select * from users which all the users into the instance variable users.
  end

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_user
  	 @user = User.find(params[:id])

UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 1\n"], ["updated_at", "2019-05-21 22:42:38.814733"], ["id", 2]]
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 2\n"], ["updated_at", "2019-06-18 18:01:38.483908"], ["id", 1]]
---
  def now_following
	  # We are adding the user.id of the user you want to
	  # follow to your following array.
	  # and we want to make sure it's saved in there as an integer
	  current_user.following.push(params[:id].to_i)
	  current_user.save

UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", nil], ["updated_at", "2019-06-18 18:01:50.680459"], ["id", 1]]
---
 def unfollow
  current_user.following.delete(params[:id].to_i)
  current_user.save