app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.create(tweet_params) #INSERT INTO Tweet (field) (values)
    @tweet = get_tagged(@tweet)
    @tweet.update(message:@tweet.message)
---
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Test"], ["user_id", 2], ["created_at", "2019-05-23 13:42:48.227012"], ["updated_at", "2019-05-23 13:42:48.227012"]]
UPDATE "tweets" SET "updated_at" = ?, "link" = ? WHERE "tweets"."id" = ?  [["updated_at", "2019-05-22 15:55:02.908182"], ["link", "http://techtalentsout..."], ["id", 9]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "Testing"], ["updated_at", "2019-05-21 21:19:22.030091"], ["id", 2]]